[
  {
    "path": "example-analyses/2021-01-26-2021-gis-user-survey/",
    "title": "2021 GIS User Survey",
    "description": "An analysis of the 2021 GIS User Survey Results",
    "author": [
      {
        "name": "Bryan Blanc",
        "url": "https://github.com/bpb824"
      }
    ],
    "date": "2021-01-26",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nRespondent Information\r\nOffice Location\r\n\r\nCurrent Software Usage and Issues\r\nSoftware Usage\r\nGIS Software Availability\r\nGIS Add-Ons\r\nNode\r\n\r\nFuture Wants and Needs\r\nMore Tools and Software\r\nResources\r\nHangout Topics\r\nMiscellaneous Comments\r\n\r\n\r\n\r\n\r\n\r\nIntroduction\r\nThis survey was conducted in January 2021 to help Team Data (formerly the GIS Team) understand user needs and wants to set priorities for the team’s non-project work over 2021. Going forward, this survey will be conducted on an annual basis in a similar way to help set overhead priorities for the year.\r\nRespondent Information\r\nThere were a total of 20 respondents to the survey. Given that there are approximately 60 R/GIS users at Nelson\\Nygaard, this indicates an estimated 33% response rate.\r\nOffice Location\r\nThree offices have 75% of the respondents – Portland, Boston, and Seattle.\r\n\r\n\r\n\r\nCurrent Software Usage and Issues\r\nWe asked several question about the availability and usage of GIS amd other software.\r\nSoftware Usage\r\nGIS and Illustrator are used relatively frequently by nearly all respondents, while about half of respondents use InDesign a few times per month or more. Only a third of respondents use R a few times per month or more.\r\n\r\n\r\n\r\nGIS Software Availability\r\nWe asked for users’ experience of availability of various GIS related software. Note that those symbolized in gray do not use the software.\r\nGIS basic is nearly universally available\r\nGIS Advanced, Network Analyst, and Spatial Analyst, are not always available, but respondents indicated they are ‘mostly’ accessible.\r\n\r\n\r\n\r\nGIS Add-Ons\r\nWe asked if there were any additional software add-ons users would like available for GIS. Full responses are presented in the below table, while the results are summarized in the following bullets:\r\nBusiness Analyst (3 users)\r\nArcGIS Online (2 users)\r\nETGeo (1 user)\r\nIntegration of ArcGIS and Adobe Illustrator (1 user)\r\n\r\n\r\n{\"x\":{\"filter\":\"top\",\"filterHTML\":\"<tr>\\n  <td data-type=\\\"character\\\" style=\\\"vertical-align: top;\\\">\\n    <div class=\\\"form-group has-feedback\\\" style=\\\"margin-bottom: auto;\\\">\\n      <input type=\\\"search\\\" placeholder=\\\"All\\\" class=\\\"form-control\\\" style=\\\"width: 100%;\\\"/>\\n      <span class=\\\"glyphicon glyphicon-remove-circle form-control-feedback\\\"><\\/span>\\n    <\\/div>\\n  <\\/td>\\n<\\/tr>\",\"caption\":\"<caption>Are there any other Esri or third-party GIS add-on tools you wish you had access to (i.e. Esri's Business Analyst)? (N=8)<\\/caption>\",\"data\":[[\"Definitely want to have access to ETGEo\",\"I think only access to ArcGIS online\",\"Not right now\",\"I think Business Analyst would be handy. I would really like to have a better understanding of which tools are available to us via ArcGIS Online, particularly the ones that we could be using for interactive maps and online engagement.\",\"Integration of Adobe Illustrator and ArcGIS\",\"Business Analyst would be great for many multimodal or mobility hub projects.\",\"ESRI  Business Analyst for employment data\",\"None that I am aware of.\"]],\"container\":\"<table class=\\\"display\\\">\\n  <thead>\\n    <tr>\\n      <th>Response<\\/th>\\n    <\\/tr>\\n  <\\/thead>\\n<\\/table>\",\"options\":{\"paging\":false,\"info\":false,\"autoWidth\":true,\"order\":[],\"orderClasses\":false,\"orderCellsTop\":true}},\"evals\":[],\"jsHooks\":[]}\r\nNode\r\nWe asked for general comments about Node usage, which has become much more common during the COVID-19 pandemic because of the need to work from home. Full responses are presented in the below table, while the results are summarized in the following bullets:\r\nIn general, respondents had positive comments about Node Usage\r\nThere were several issues noted:\r\nInconvenience of connecting to different nodes. Quick access folder settings are lost, as are other user-based settings, which is inconvenient. We have resolved the need to re-install R packages with a common R package repository.\r\nIssues in accessing Sharepoint. Multiple respondents indicated it is difficult to access Sharepoint on Node computers.\r\nAdobe Illustrator/InDesign usage on Node. It is very slow to use Adobe software on the Node without access to a local server.\r\n\r\n\r\n{\"x\":{\"filter\":\"top\",\"filterHTML\":\"<tr>\\n  <td data-type=\\\"character\\\" style=\\\"vertical-align: top;\\\">\\n    <div class=\\\"form-group has-feedback\\\" style=\\\"margin-bottom: auto;\\\">\\n      <input type=\\\"search\\\" placeholder=\\\"All\\\" class=\\\"form-control\\\" style=\\\"width: 100%;\\\"/>\\n      <span class=\\\"glyphicon glyphicon-remove-circle form-control-feedback\\\"><\\/span>\\n    <\\/div>\\n  <\\/td>\\n<\\/tr>\",\"caption\":\"<caption>Any other requests or comments about Node? (N=10)<\\/caption>\",\"data\":[[\"WOuld be nice if I didn't have to enter my password to get into Node\",\"None\",\"Node works great for me! I actually prefer it to using ArcGIS on my desktop.\",\"It would be great if the same Node was connected to each time so Quick access folders remained the same, but other than that Node works great!\",\"I know that we weren't able to get R packages installed across all nodes, but I've been using R quite a bit on node and rarely had any issues. Sometimes I need to install packages but I think it often gives me the same node so it's not an issue. Works better than expected!    The biggest issue I have with node is being able to access sharepoint. Is there a work around for this?\",\"Always works quite well for me!\",\"When I log out and log back in, my quick access folders aren’t there anymore. It would be awesome if that worked. I love that node is fast.\",\"It is unclear what causes some delay and sluggishness, but the mid-year IT change for near-instant saving across servers was very helpful. I find it frustrating when settings change based on the instance that Node connects to.\",\"Is Node going to be the default method of using GIS even after returning to offices?\",\"Wish it had Adobe (Illustrator and InDesign) on Node. InDesign can get slow without local server.\"]],\"container\":\"<table class=\\\"display\\\">\\n  <thead>\\n    <tr>\\n      <th>Response<\\/th>\\n    <\\/tr>\\n  <\\/thead>\\n<\\/table>\",\"options\":{\"paging\":false,\"info\":false,\"autoWidth\":true,\"order\":[],\"orderClasses\":false,\"orderCellsTop\":true}},\"evals\":[],\"jsHooks\":[]}\r\nFuture Wants and Needs\r\nMore Tools and Software\r\nThere were several comments given on the development of R/Shiny dashboard tools in 2021:\r\nStandardized tools for transit data (APC/AVL) dashboards, especially for route profiles.\r\nDevelopment of shared parking model dashboard\r\nTools to automate the cleanup and analysis of crash data\r\n\r\n\r\n{\"x\":{\"filter\":\"top\",\"filterHTML\":\"<tr>\\n  <td data-type=\\\"character\\\" style=\\\"vertical-align: top;\\\">\\n    <div class=\\\"form-group has-feedback\\\" style=\\\"margin-bottom: auto;\\\">\\n      <input type=\\\"search\\\" placeholder=\\\"All\\\" class=\\\"form-control\\\" style=\\\"width: 100%;\\\"/>\\n      <span class=\\\"glyphicon glyphicon-remove-circle form-control-feedback\\\"><\\/span>\\n    <\\/div>\\n  <\\/td>\\n<\\/tr>\",\"caption\":\"<caption>Are there any tools we should develop in GIS, R, Illustrator or InDesign? (N=6)<\\/caption>\",\"data\":[[\"One that can be big for the firm is to start developing a Route Profile Dashboard using APC and R shiny\",\"Tools regarding above\",\"It might be nice to develop some tools that automate some aspects of a standard crash data cleanup and analysis, but I don't have any specific ideas.\",\"A dashboard with APC and or AVL data out into standardized format would be great.\",\"PLEASE PLEASE help finish the development of the shared parking model as an R Shiny app so we can deploy it for projects and make it fully interactive online.\",\"None that I am aware of.\"]],\"container\":\"<table class=\\\"display\\\">\\n  <thead>\\n    <tr>\\n      <th>Response<\\/th>\\n    <\\/tr>\\n  <\\/thead>\\n<\\/table>\",\"options\":{\"paging\":false,\"info\":false,\"autoWidth\":true,\"order\":[],\"orderClasses\":false,\"orderCellsTop\":true}},\"evals\":[],\"jsHooks\":[]}\r\nThere were a few other tools users wanted Team Data to investigate:\r\nMapbox vs. ArcGIS Storymaps\r\nTravel time querying alternatives to Google Maps\r\nInstallation of javascript-based leaflet add-ons for use in R\r\nStrava or equivalent data for bicycle demand estimation\r\n\r\n\r\n{\"x\":{\"filter\":\"top\",\"filterHTML\":\"<tr>\\n  <td data-type=\\\"character\\\" style=\\\"vertical-align: top;\\\">\\n    <div class=\\\"form-group has-feedback\\\" style=\\\"margin-bottom: auto;\\\">\\n      <input type=\\\"search\\\" placeholder=\\\"All\\\" class=\\\"form-control\\\" style=\\\"width: 100%;\\\"/>\\n      <span class=\\\"glyphicon glyphicon-remove-circle form-control-feedback\\\"><\\/span>\\n    <\\/div>\\n  <\\/td>\\n<\\/tr>\",\"caption\":\"<caption>Are there any tools/data you would like us to explore and investigate? (N=6)<\\/caption>\",\"data\":[[\"Curious about using Mapbox instead of ESRI Storymaps.\",\"Nothing comes to mind right now!\",\"Lately I have come across a few instances where I need some extra leaflet functionality or add-ons that are not a part of the regular R leaflet or leaflet.extras packages, but they are available as extra leaflet javascript libraries. I've read about a way to install javascript packages for use in R but have yet to have any success. If this is something Bryan is interested in looking into I think it could be really helpful to extend our Shiny functionality to more closely match what's available through regular javascript web development.\",\"An alternative to Google maps API for travel time would be great.\",\"Strava (or equivalent) data for bike demand\",\"None that I am aware of.\"]],\"container\":\"<table class=\\\"display\\\">\\n  <thead>\\n    <tr>\\n      <th>Response<\\/th>\\n    <\\/tr>\\n  <\\/thead>\\n<\\/table>\",\"options\":{\"paging\":false,\"info\":false,\"autoWidth\":true,\"order\":[],\"orderClasses\":false,\"orderCellsTop\":true}},\"evals\":[],\"jsHooks\":[]}\r\nResources\r\nWe asked users for ideas on training resources we should develop. Full responses are presented in the table, and summary bullets are given below: - Static GIS Map Checklist: Providing Associates with a checklist of elements they should include on every map (e.g., scale bar, north arrow) would help ensure map consistency. - How-to Guides for GIS - Hexbins - Getting Canadian data sources (this exists, needs to be communicated) - ArcGIS Pro - How-to Guides for R - LEHD/Census data (this exists, needs to be better communicated) - GTFS data (this exists, needs to be better communicated) - Spider lines - Integration of R and Illustrator for static mapping - Interactive map styling - In general, making methodology documentation easy to find - Adding more commonly used data to the G Drive\r\n\r\n\r\n{\"x\":{\"filter\":\"top\",\"filterHTML\":\"<tr>\\n  <td data-type=\\\"character\\\" style=\\\"vertical-align: top;\\\">\\n    <div class=\\\"form-group has-feedback\\\" style=\\\"margin-bottom: auto;\\\">\\n      <input type=\\\"search\\\" placeholder=\\\"All\\\" class=\\\"form-control\\\" style=\\\"width: 100%;\\\"/>\\n      <span class=\\\"glyphicon glyphicon-remove-circle form-control-feedback\\\"><\\/span>\\n    <\\/div>\\n  <\\/td>\\n<\\/tr>\",\"caption\":\"<caption>Are there any GIS/cartography/R resources we should develop (how to guides, style reference, one-pager about data, training, etc.)? (N=12)<\\/caption>\",\"data\":[[\"I'd love the opportunity to learn how to style maps and data outputs using Leaflet, D3, or R. (More of a personal goal than a request per se.)\",\"Yes, and I think we can develop three basic how two if there is enough people that find it interesting/useful.  I might be able to help drafting some of them:  - How to generate OD lines (spider map) using R  - How to retrieve LEHD data and Census data using R LODES and tidycensus packages   - How to generate shapes and stop geometry's using GTFS\",\"R how to guides on handling LEHD and census data, as well as anything working with GTFS to determine average frequencies/spans\",\"I'd like us to get better about documenting GIS and R analysis methods and cataloguing them. I don't know how consistently most people write methodology memos, or even take notes. I'd like some of the best ones to be stored on the G drive so, for example, if I want to do a similar transit market analysis to what Suzie has done in Boston, I can easily find detailed documentation of it.\",\"Some how to guides for how to work across ArcMap -&gt; R -&gt; Illustrator would be helpful. I've found the workflow of creating maps and/or graphics in R and exporting to an svg so they can be used in illustrator has been really nice, for example. I used this workflow with Layne on COIC Redmond and it worked well. There are some tips and tricks to help, like keeping the map extent constant if generating a series, that are not always obvious.    I think some simple how-to's or catalogues of code snippets for R would be helpful. I'm thinking especially of things that should be quick but can take too long to remember how to do if you don't do them often, like how to create a palette to use with R Leaflet or certain ggplot options.     If more folks are going to continue using Shiny, I think some basic css/html training could be useful\",\"Continue to update and add to G:\\\\Data\",\"Written how to guides based on tips and tricks shared during GIS/Vizcomm hangouts. For example, something to reference with regards to the best GIS-to-Illustrator workflow.\",\"It would be great to have a checklist for associates submitting maps for review. I get a lot of maps with obvious errors like no north arrow, scale bar, typos, etc. I think a checklist would help associates walk through their work before submitting. Happy to help with this.\",\"There are some great how-tos and analysis process guides, I would say keep them coming to have standardized approaches\",\"how-to guide for hexbins, style reference for basemaps, help on getting Canadian data sources\",\"None that I am aware of.\",\"ArcGIS Pro guides\"]],\"container\":\"<table class=\\\"display\\\">\\n  <thead>\\n    <tr>\\n      <th>Response<\\/th>\\n    <\\/tr>\\n  <\\/thead>\\n<\\/table>\",\"options\":{\"paging\":false,\"info\":false,\"autoWidth\":true,\"order\":[],\"orderClasses\":false,\"orderCellsTop\":true}},\"evals\":[],\"jsHooks\":[]}\r\nHangout Topics\r\nAdditional GIS Hangout topics respondents would like to see include the following:\r\nNN GIS 101 (especially file saving protocol)\r\nIdeas for how to use ArcGIS online accounts\r\n\r\n\r\n{\"x\":{\"filter\":\"top\",\"filterHTML\":\"<tr>\\n  <td data-type=\\\"character\\\" style=\\\"vertical-align: top;\\\">\\n    <div class=\\\"form-group has-feedback\\\" style=\\\"margin-bottom: auto;\\\">\\n      <input type=\\\"search\\\" placeholder=\\\"All\\\" class=\\\"form-control\\\" style=\\\"width: 100%;\\\"/>\\n      <span class=\\\"glyphicon glyphicon-remove-circle form-control-feedback\\\"><\\/span>\\n    <\\/div>\\n  <\\/td>\\n<\\/tr>\",\"caption\":\"<caption>Are there any topics we should cover at Hangout? (N=4)<\\/caption>\",\"data\":[[\"Tools/apps that we can use with our ArcGIS Online accounts; crash analysis\",\"I've had to miss the last few but have really enjoyed them in the past. I'm not sure I have suggestions other than keep up the good work and continue to include interesting project demos.\",\"N/A\",\"NN GIS 101, especially file saving protocol\"]],\"container\":\"<table class=\\\"display\\\">\\n  <thead>\\n    <tr>\\n      <th>Response<\\/th>\\n    <\\/tr>\\n  <\\/thead>\\n<\\/table>\",\"options\":{\"paging\":false,\"info\":false,\"autoWidth\":true,\"order\":[],\"orderClasses\":false,\"orderCellsTop\":true}},\"evals\":[],\"jsHooks\":[]}\r\nMiscellaneous Comments\r\nThe major miscellaneous additional comment of note was the use of Illustrator in the remote context, and how to work with it on server drives, as has been raised elsewhere in the survey.\r\n\r\n\r\n{\"x\":{\"filter\":\"top\",\"filterHTML\":\"<tr>\\n  <td data-type=\\\"character\\\" style=\\\"vertical-align: top;\\\">\\n    <div class=\\\"form-group has-feedback\\\" style=\\\"margin-bottom: auto;\\\">\\n      <input type=\\\"search\\\" placeholder=\\\"All\\\" class=\\\"form-control\\\" style=\\\"width: 100%;\\\"/>\\n      <span class=\\\"glyphicon glyphicon-remove-circle form-control-feedback\\\"><\\/span>\\n    <\\/div>\\n  <\\/td>\\n<\\/tr>\",\"caption\":\"<caption>Any other comments / requests? (N=3)<\\/caption>\",\"data\":[[\"Keep up the good work! I'm really excited for the joint GIS and R team!\",\"I work in Illustrator outside of the Node. For files saved on the G Drive, it takes a very long time to save the document. Not sure if others experience this or if this is just due to WFH, but thought I'd mention it here.\",\"Nearmap is awesome.\"]],\"container\":\"<table class=\\\"display\\\">\\n  <thead>\\n    <tr>\\n      <th>Response<\\/th>\\n    <\\/tr>\\n  <\\/thead>\\n<\\/table>\",\"options\":{\"paging\":false,\"info\":false,\"autoWidth\":true,\"order\":[],\"orderClasses\":false,\"orderCellsTop\":true}},\"evals\":[],\"jsHooks\":[]}\r\n\r\n\r\n\r\n",
    "preview": "example-analyses/2021-01-26-2021-gis-user-survey/2021-gis-user-survey_files/figure-html5/office-loc-1.png",
    "last_modified": "2021-02-03T09:16:21-08:00",
    "input_file": {},
    "preview_width": 1536,
    "preview_height": 768
  }
]
